src/Documents/ОплатаУчастниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ОплатаУчастниками</Name>
			<BasedOn>
				<xr:Item>Document.УчастиеВМероприятии</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностьКазначея</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьУчастников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Участники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатыВТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Участники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ЗадолженностьУчастников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьУчастников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Участники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ОплатаУчастниками/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОплатыВТабличнойЧастиПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры


//
&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ГруппаШапка.Видимость = (НЕ Объект.ОплатыВТабличнойЧасти);
	Элементы.ГруппаТабЧасть.Видимость = Объект.ОплатыВТабличнойЧасти;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеДолгиУчастникаНаСервере(ВыбранныйУчастник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиЗУ.Мероприятие КАК Мероприятие,
	|	ОстаткиЗУ.Участник КАК Участник,
	|	ОстаткиЗУ.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ЗадолженностьУчастников.Остатки(, Участник = &ВыбранныйУчастник) КАК ОстаткиЗУ
	|ГДЕ
	|	ОстаткиЗУ.СуммаОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Мероприятие
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ВыбранныйУчастник", ВыбранныйУчастник);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 

	НайденныеСтроки = Объект.Оплаты.НайтиСтроки(Новый Структура("Участник", ВыбранныйУчастник));
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		Объект.Оплаты.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Оплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьВсеДолгиУчастника(Команда)
	
	ТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	ВыбранныйУчастник = ?(ТекущиеДанные <> Неопределено, ТекущиеДанные.Участник, ПредопределенноеЗначение("Справочник.Участники.ПустаяСсылка"));
	ВыбранныйУчастник = Ждать ВвестиЗначениеАсинх(ВыбранныйУчастник, "Выберите участника", Тип("СправочникСсылка.Участники"));
	Если ВыбранныйУчастник <> Неопределено Тогда
		ЗаполнитьВсеДолгиУчастникаНаСервере(ВыбранныйУчастник);
	КонецЕсли;
	
КонецПроцедуры
